<html>
<head>
<title>Introducci&oacute;n a Java: Introducci&oacute;n</title>
<link rel="stylesheet" type="text/css" href="tppmsgs/msgs0.htm#5" tppabs="http://www.programacion.net/java/intjava/manual.css">
</head>
<body bgcolor="#ffffff" link="#800080" vlink="#ff0000" alink="#808000" background="fondotut.gif" tppabs="http://www.programacion.net/java/graficos/fondotut.gif">
<table border="0" cellspacing="0" cellpadding="0" width="100%">
<tr>
<td width="60"><img src="empty.gif" tppabs="http://www.programacion.net/java/graficos/empty.gif" width="60" height="1"></td><td>
<center>
<table border="0" width="610">
<tr>
<td valign="top"><a href="tppmsgs/msgs0.htm#1" tppabs="http://www.programacion.net/java/index.html"><img src="logojava.gif" tppabs="http://www.programacion.net/java/graficos/logojava.gif" alt="Volver a la p&aacute;gina principal de JAVA en castellano" border="0"></a></td><td valign="top" width="470">
<table border="0" cellpadding="3" cellspacing="3" width="100%">
<tr>
<td valign="top" align="center">Java en castellano recomienda...</td>
</tr>
<tr>
<td align="center"><IFRAME SRC="tppmsgs/msgs0.htm#2" tppabs="http://ad.es.doubleclick.net/adi/ES-programacion.net/ES-redferca-programacion-java;sz=468x60;ord=66414537083757200?" name="frame1" width="468" height="60" frameborder="no" border="0" MARGINWIDTH="0" MARGINHEIGHT="0" SCROLLING="no"><SCRIPT language="JavaScript1.1" SRC="tppmsgs/msgs0.htm#3" tppabs="http://ad.es.doubleclick.net/adj/ES-programacion.net/ES-redferca-programacion-java;abr=!ie;sz=468x60;ord=66414537083757200?"></SCRIPT>
<NOSCRIPT>
<A HREF="tppmsgs/msgs0.htm#4" tppabs="http://ad.es.doubleclick.net/jump/ES-programacion.net/ES-redferca-programacion-java;abr=!ie;sz=468x60;ord=66414537083757200?"><IMG SRC="ES-redferca-programacion-java;abr=!ie;sz=468x60;ord=66414537083757200-" tppabs="http://ad.es.doubleclick.net/ad/ES-programacion.net/ES-redferca-programacion-java;abr=!ie;sz=468x60;ord=66414537083757200?" border="0" height="60" width="468"></A>
</NOSCRIPT>
</IFRAME></td>
</tr>
</table>
</td>
</tr>
</table>
</center>
<p class="tituloMan">Introducci&oacute;n a Java</p>
<table border="0" width="100%">
<tr>
<td align="right"><a href="indice.htm" tppabs="http://www.programacion.net/java/intjava/indice.htm"><img src="indice.gif" tppabs="http://www.programacion.net/java/graficos/indice.gif" border="0"></a><a href="primera.htm" tppabs="http://www.programacion.net/java/intjava/primera.htm"><img src="siguiente.gif" tppabs="http://www.programacion.net/java/graficos/siguiente.gif" border="0"></a>
<br>
<img src="linea.gif" tppabs="http://www.programacion.net/java/graficos/linea.gif" width="100%" height="1"></td>
</tr>
</table>
<p>En esta p&aacute;gina:</p>
<table bgcolor="#F5F4EB" width="100%">
<tr>
<td>
<ul>
<font face="Verdana" size="2">
<li>
<a href="#introduccion">Introducci&oacute;n</a>
</li>
</font>
<ul>
<font face="Verdana" size="2">
<li>
<a href="#portabilidad">Portabilidad</a>
</li>
</font>
</ul>
<ul>
<font face="Verdana" size="2">
<li>
<a href="#orientacionaobjetos">Orientaci&oacute;n a objetos</a>
</li>
</font>
</ul>
</ul>
</td>
</tr>
</table>
<br>
<p class="tituloCap">Introducci&oacute;n</p>
<p>Java es un lenguaje desarrollado por Sun con la intenci&oacute;n de competir con Microsoft en el
mercado de la red. Sin embargo, su historia se remonta a la creaci&oacute;n de una filial de Sun
(FirstPerson) enfocada al desarrollo de aplicaciones para electrodom&eacute;sticos, microondas,
lavaplatos, televisiones... Esta filial desapareci&oacute; tras un par de &eacute;xitos de laboratorio y ning&uacute;n
desarrollo comercial.</p>

<p>Sin embargo, para el desarrollo en el laboratorio, uno de los trabajadores de FirstPerson,
James Gosling, desarroll&oacute; un lenguaje derivado de C++ que intentaba eliminar las
deficiencias del mismo. Llam&oacute; a ese lenguaje Oak. Cuando Sun abandon&oacute; el proyecto de
FirstPerson, se encontr&oacute; con este lenguaje y, tras varias modificaciones (entre ellas la del
nombre), decidi&oacute; lanzarlo al mercado en verano de 1995.</p>

<p>El &eacute;xito de Java reside en varias de sus caracter&iacute;sticas. Java es un lenguaje sencillo, o todo lo
sencillo que puede ser un lenguaje orientado a objetos, eliminando la mayor parte de los
problemas de C++, que aport&oacute; su granito (o tonelada) de arena a los problemas de C. Es un
lenguaje independiente de plataforma, por lo que un programa hecho en Java se ejecutar&aacute;
igual en un PC con Windows que en una estaci&oacute;n de trabajo basada en Unix. Tambi&eacute;n hay
que destacar su seguridad, desarrollar programas que accedan ilegalmente a la memoria o
realizar caballos de troya es una tarea propia de titanes.</p>

<p>Cabe mencionar tambi&eacute;n su capacidad multihilo, su robustez o lo integrado que tiene el
protocolo TCP/IP, lo que lo hace un lenguaje ideal para Internet. Pero es su sencillez,
portabilidad y seguridad lo que le han hecho un lenguaje de tanta importancia.</p>


<p class="tituloSubCap">Portabilidad</p>
<p>La portabilidad se consigue haciendo de Java un lenguaje medio interpretado medio
compilado. &iquest;C&oacute;mo se come esto? Pues se coge el c&oacute;digo fuente, se compila a un lenguaje
intermedio cercano al lenguaje m&aacute;quina pero independiente del ordenador y el sistema
operativo en que se ejecuta (llamado en el mundo Java <b>bytecodes</b>) y, finalmente, se interpreta
ese lenguaje intermedio por medio de un programa denominado m&aacute;quina virtual de Java.</p>

<p>Este esquema lo han seguido otros lenguajes, como por ejemplo Visual Basic. Sin embargo,
nunca se hab&iacute;a empleado como punto de partida a un lenguaje multiplataforma ni se hab&iacute;a
hecho de manera tan eficiente. Cuando Java apareci&oacute; en el mercado se hablaba de que era
entre 10 y 30 veces m&aacute;s lento que C++. Ahora, con los compiladores JIT (<b>Just in Time</b>) se
habla de tiempos entre 2 y 5 veces m&aacute;s lentos. Con la potencia de las m&aacute;quinas actuales, esa
lentitud es un precio que se puede pagar sin problemas contemplando las ventajas de un
lenguaje portable.</p>




<p class="tituloSubCap">Orientaci&oacute;n a objetos</p>
<p>Dado que Java es un lenguaje orientado a objetos, es imprescindible entender qu&eacute; es esto y
en qu&eacute; afecta a nuestros programas. Desde el principio, la carrera por crear lenguajes de
programaci&oacute;n ha sido una carrera para intentar realizar abstracciones sobre la m&aacute;quina. Al
principio no eran grandes abstracciones y el concepto de lenguajes imperativos es prueba de
ello. Exigen pensar en t&eacute;rminos del ordenador y no en t&eacute;rminos del problema a solucionar.
Esto provoca que los programas sean dif&iacute;ciles de crear y mantener, al no tener una relaci&oacute;n
obvia con el problema que representan No abstraen lo suficiente.</p>

<p>Muchos paradigmas de programaci&oacute;n intentaron resolver este problema alterando la visi&oacute;n
del mundo y adapt&aacute;ndola al lenguaje. Estas aproximaciones modelaban el mundo como un
conjunto de objetos o de listas. Funcionaban bien para algunos problemas pero no para otros.
Los lenguajes orientados a objetos, m&aacute;s generales, permiten realizar soluciones que, le&iacute;das,
describen el problema. Permiten escribir soluciones pensando en el problema y no en el
ordenador que debe solucionarlo en &uacute;ltimo extremo. Se basan en cinco caracter&iacute;sticas:</p>

<ul>
  <li>
<b>Todo es un objeto</b>. Cada elemento del problema debe ser modelizado como un
objeto.</li>
  <li>
<b>Un programa es un conjunto de objetos diciendose entre s&iacute; que deben hacer por
medio de mensajes</b>. Cuando necesitas que un objeto haga algo le mandas un
mensajes. M&aacute;s concretamente, ejecutas un m&eacute;todo de dicho objeto.</li>
  <li>
<b>Cada objeto tiene su propia memoria, que llena con otros objetos</b>. Cada objeto
puede contener otros objetos. De este modo se puede incrementar la complejidad del
programa, pero detr&aacute;s de dicha complejidad sigue habiendo simples objetos.</li>
  <li>
<b>Todo objeto tiene un tipo</b>. En jerga POO, cada objeto es una instancia (un caso
particular) de una clase (el tipo general). Lo que distingue a una clase de otra es la
respuesta a la pregunta, &iquest;qu&eacute; mensajes puedes recibir?</li>
  <li>
<b>Todos los objetos de un determinado tipo pueden recibir los mismos mensajes</b>. Por
ejemplo, dado que un objeto de tipo Gato es tambi&eacute;n un objeto de tipo Animal, se
puede hacer c&oacute;digo pensando en los mensajes que se mandan a un animal y aplicarlo
a todos los objetos de ese tipo, sin pensar si son tambi&eacute;n gatos o no.</li>
</ul>

<p>Eso de que la programaci&oacute;n orientada a objetos intente establecer una relaci&oacute;n biun&iacute;voca
entre el espacio del problema y el de la soluci&oacute;n est&aacute; muy bien pero... &iquest;c&oacute;mo hacemos que un
objeto realice cosas &uacute;tiles y necesarias? Por medio de su interfaz, interfaz que est&aacute; definida
en la clase del objeto. Por ejemplo, supongamos que tenemos la clase Interruptor cuyo
interfaz define los m&eacute;todos apagar() y encender(). Entonces hacemos lo siguiente:</p>

<b>Interfaz de un objeto</b>
<pre class="codigo">
Interruptor i = new Interruptor();
i.encender();
</pre>

<p>Primero creamos una referencia llamada i de tipo Interruptor, y luego creamos un objeto, una
instancia de dicho tipo, por medio de la palabra reservada <span class="codigoenlinea">new</span>. Asignamos ese objeto a la
referencia por medio del signo =. Por &uacute;ltimo, enviamos un mensaje al objeto reci&eacute;n creado y
asignado poniendo el nombre de la referencia, un punto, y el nombre del mensaje (m&eacute;todo).</p>



<table border="0" width="100%">
<tr>
<td align="right"><a href="indice.htm" tppabs="http://www.programacion.net/java/intjava/indice.htm"><img src="indice.gif" tppabs="http://www.programacion.net/java/graficos/indice.gif" border="0"></a><a href="primera.htm" tppabs="http://www.programacion.net/java/intjava/primera.htm"><img src="siguiente.gif" tppabs="http://www.programacion.net/java/graficos/siguiente.gif" border="0"></a>
<br>
<img src="linea.gif" tppabs="http://www.programacion.net/java/graficos/linea.gif" width="100%" height="1"></td>
</tr>
</table>
</td><td width="40"><img src="empty.gif" tppabs="http://www.programacion.net/java/graficos/empty.gif" width="40" height="1"></td>
</tr>
</table>
</body>
</html>
